tutorials/conjugateHeatFoam/conjugateCavity/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/hjasak/OpenFOAM/hjasak-1.3/run/coupledMatrix";
    case "conjugateCavity";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
movingWall
{
    type wall;
    nFaces 10;
    startFace 180;
}

left
{
    type wall;
    nFaces 10;
    startFace 190;
}

right
{
    type regionCouple;
    nFaces 10;
    startFace 200;

    shadowRegion    solid;
    shadowPatch     left;
    attached        on;
}

bottom
{
    type wall;
    nFaces 10;
    startFace 210;
}

frontAndBack
{
    type empty;
    nFaces 200;
    startFace 220;
}
)

// ************************************************************************* //
